** Python
#+BEGIN_SRC emacs-lisp
;(require 'flycheck-pyflakes)
;(add-hook 'python-mode-hook 'flycheck-mode)

;(add-to-list 'flycheck-disabled-checkers 'python-flake8)
;(add-to-list 'flycheck-disabled-checkers 'python-pylint)
;I had to reinstall concurrent to get this to work.
;(use-package jedi
;:ensure t
;:init
;(add-hook 'python-mode-hook 'jedi:setup)
;(add-hook 'python-mode-hook 'jedi:ac-setup))

; Enable execution of code blocks.
;; (org-babel-do-load-languages
;;  'org-babel-load-languages
;;  '((python . t)))

(add-hook 'python-mode-hook 'linum-mode)

(setq python-indent-offset 4)

(add-to-list 'org-structure-template-alist '("p" "#+BEGIN_SRC python :results output\n?\n#+END_SRC" "<src lang=\"python\">\n\n</src>"))

;path for virtual environments.
;; (add-dir-local-variable $WORKON_HOME 'C:\Users\PayneFamily\Dropbox\Python\envs')

;(require 'virtualenvwrapper)
;(venv-initialize-interactive-shells) ;; if you want interactive shell support
;(venv-initialize-eshell) ;; if you want eshell support
;; note that setting `venv-location` is not necessary if you
;; use the default location (`~/.virtualenvs`), or if the
;; the environment variable `WORKON_HOME` points to the right place
#+END_SRC

#+BEGIN_SRC python :results output
print "It works!!!" + "YAY" ' ... still works'
#+END_SRC

#+RESULTS:
: It works!!!YAY ... still works

